In [1]:
import os

In [2]:
import mysql.connector

In [3]:
import pandas as pd

In [4]:
connection = mysql.connector.connect(host = 'localhost',user = 'root', password = 'cUny$p$_7', db ='chinook' )

In [5]:
connection

In [6]:
query = '''SELECT LastName, FirstName, track.Name, album.Title FROM customer 
INNERE JOIN invoice USING (CustomerID)
INNER JOIN invoiceline
USING (InvoiceID)
INNER JOIN track
USING (TrackID)
INNER JOIN album
USING (AlbumID)
ORDER BY LastName, FirstName'''

In [7]:
chinook = pd.read_sql_query(query, connection)

In [8]:
chinook.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas